{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_59", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "units": 60, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "units": 180, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "units": 360, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "units": 720, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "activation": "tanh"}}, {"class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "batch_input_shape": [null, 720], "dtype": "float32", "target_shape": [10, 6, 3, 4]}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_15", "trainable": true, "size": [2, 2, 1], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_38", "trainable": true, "filters": 4, "kernel_size": [2, 2, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "activation": "tanh"}}, {"class_name": "UpSampling3D", "config": {"name": "up_sampling3d_16", "trainable": true, "size": [2, 2, 1], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_39", "trainable": true, "filters": 2, "kernel_size": [2, 2, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "activation": "tanh"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_40", "trainable": true, "filters": 1, "kernel_size": [2, 2, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "activation": "tanh"}}], "keras_version": "2.0.4", "backend": "tensorflow"}